// 4-1번 문제 object를 호출하는 방법에는 [""]방식과 .을 이용한 방식이 있다.

/* 4-2번 문제 
1 2
1 5
1 8
4 2
4 5
4 8
이 출력되는 for문 작성. 모르겠어요 ㅜㅜ*/ 
for(i = 1; i < 5; i++);
  for(k = 2; k <9; k); 

/* 4-3번 문제 
id 선택자와 class 선택자의 차이점으로는
1. id는 중복사용이 불가한데 class는 중복사용이 가능하다.
2. id는 불러올 때 #을 사용하고 class는 불러올 때 .을 사용한다.

/* 4-4번 문제 
let a = 3;
let b = 4;
let c = a++ + --b;
console.log(a, b, ++c);

의 결과값으로는 
a가 4, b가 3, c가 7이 나온다.
콘솔로 선언할 때 a는 후위연산자이니 4가 되었고 b는 전위연산자여서 그대로 3이 출력, c는 3+3에서 전위연산자가 쓰여 7로 출력되었다.
*/

// 4-5번 문제 이메일을 입력받고 '@'전까지만 출력하시오.
input = prompt("이메일을 입력하세요.");
console.log(input);

//4-6번 문제 lenght를 사용하여 let array = [1, 2, 3, 4, 5]; 를 모두 출력하는 for문을 작성.

/* 
4-7번 문제 빈칸 채우기.

let sum = 0;
for(let i = 0; i <= 100; i++){
 //채우세요.
}
console.log(sum);

*/

//4-8번 사용자가 컴퓨터가 생각하고 있는 숫자를 맞추는 프로그램을 짜시오.

/* 4-9번 Object를 이용해 학생 3명의 이름과 학점, 백분율을 작성하시고, 학점이 3.0 이상이고 백분율
이 90이상인 학생만을 출력하시오.*/
